// Напишите программу, которая на вход принимает число
// и выдает его квадрат( число умноженное само на себя).
// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49
Console.WriteLine("Введите целое число");
int number = Convert.ToInt32(Console.ReadLine());
int resultSquare = number * number;
Console.WriteLine(resultSquare);



